app/controllers/gists_controller.rb

SELECT "gists".* FROM "gists"
SELECT "gists".* FROM "gists" ORDER BY "gists"."created_at" ASC LIMIT 25 OFFSET 0
---
  def index
    if(session[:user_id] && !session[:all_gists])
      @gists = Gist.order("created_at desc").find_user(session[:user_id])
    else
      @gists = Gist.order("created_at desc")
      if(!params[:desc].blank?)
        @gists = @gists.search(params[:desc])
        end
     end



    @gists = Kaminari.paginate_array(@gists).page(params[:page])# pagination

INSERT INTO "gists" ("created_at", "description", "lang", "owner", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @gist = Gist.new(change_lang(gist_params))
    @gist.user = User.find(session[:user_id])

    respond_to do |format|
      if @gist.save