app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    # @posts = Post.order(:created_at).page(params[:page]) # pagination
    @posts = Post.all