app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 12 May 2014 18:56:38 UTC +00:00], ["name", "Kacper Czechowicz"], ["provider", "github"], ["uid", "1098582"], ["updated_at", Mon, 12 May 2014 18:56:38 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'github' AND "users"."uid" = '1098582' LIMIT 1
---
  def create
	auth = request.env["omniauth.auth"]
   	user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)